app/views/users/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
										<i class="fa fa-heart" aria-hidden="true"></i>
										<%= book.favorites.count %>

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
							<td>
								<%= link_to "コメント数#{book.book_comments.count}", book_path(book) %>