app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
									<i class="fa fa-heart" aria-hidden="true"></i>
									<%= @book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
									<i class="fa fa-heart-o" aria-hidden="true"></i>
									<%= @book.favorites.count %>